import { Collapse } from "antd";
const { Panel } = Collapse;

const Explanation = () => {
  return (
    <Collapse>
      <Panel header="מקרא לטבלה" key="1">
        <p>אותיות - האותיות המייצגות את המפלגה בפתק הקלפי</p>
        <p>שם - השם הרשמי של המפלגה</p>
        <p>אחוז(*) - אחוז הקולות אותה המפלגה קיבלה מסך כל הקולות הכשרים</p>
        <p>קולות(*) - מספר הקולות שקיבלה המפלגה</p>
        <p>הסכם(*) - אותיות המפלגה עמה נחתם הסכם עודפים</p>
        <p>
          ללא הסכם(*)(**) - כמות המנדטים אותה הייתה המפלגה מקבלת במידה ואף מפלגה
          לא הייתה חותמת על הסכם עודפים
        </p>
        <p>
          לפני בדר עופר(*)(**) - מספר המנדטים אותה הייתה המפלגה מקבלת לפני חלוקת
          השארית בהתאם לנוסחת בדר עופר
        </p>
        <p>
          מרחק - המרחק המנימלי של קולות נוספים הנצרכים למפלגה על מנת לקבל מנדט
          נוסף (כרגע לא מדויק במקרי קצה מסוימים)
        </p>
        <p>מנדטים(*) - מספר המנדטים הסופי אותה קיבלה המפלגה</p>
        <br />
        <p>(*)</p>
        <p>הנתונים המופיעים בסוגריים משקפים את השינוי מהנתון המקורי בטבלה זו</p>
        <p>(**)</p>
        <p>רקע ירוק - המפלגה הרוויחה מהסכמי העודפים/נוסחת בדר עופר</p>
        <p>רקע אדום - המפלגה הפסידה מהסכמי העודפים/נוסחת בדר עופר</p>
      </Panel>
    </Collapse>
  );
};

export default Explanation;
